/**
 * Created by Administrator on 2015/12/12.
 * 网站左侧导航之假数据
 */
define([
    'mock'
],function(Mock){
    var s  = ['平板电视','空调','冰箱','洗衣机','家庭影院','DVD','迷你音箱','灶具','热水器','消毒柜','洗碗机','冷柜','酒柜','家电配件'];
   return Mock.mock({
        'results|15':[
            {
                'id|+1': 1,
                'name|1': ['家用电器','电脑、办公','手机、数码、通信','家居、家具、家装、厨具','男装、女装、内衣、珠宝','个护化妆、清洁用品','鞋包、箱包、钟表、奢侈品','运动户外','汽车、汽车用品','图书、音响、电子书','营养保健','彩票、旅行、充值、票务','食品、酒类、生鲜、特产'],
                'children|5-7': [
                    {
                        'id|+1': 20,
                        'name|1': ['大家电', '生活电器', '厨房电器', '个护健康', '五金家装','家居','小电器','其他'],
                        'children|8-14': function () {
                            var arr = ['平板电视','空调','冰箱','洗衣机','家庭影院','DVD','迷你音箱','灶具','热水器','消毒柜','洗碗机','冷柜','酒柜','家电配件'];
                            var currentArr = [];
                            //随机生成18-27个数字(某个二级菜单的子元素个数)
                            for (var i = 0, len = Math.floor(Math.random() * 10) + 18; i < len; i++) {
                                //这里也可以去一下重
                                currentArr.push(arr[Math.floor(Math.random() * arr.length)]);
                            }
                            return currentArr;
                        }
                    }
                ]
            }
        ]
    });
});